DDC-NDRS/zephyr_hal_nxp/s32/drivers/s32k3/Adc/include/Adc_Sar_Ip.h
/*
 * Copyright 2020-2023 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef ADC_SAR_IP_H
#define ADC_SAR_IP_H

/**
 *   @file
 *
 *   @addtogroup adc_sar_ip Adc Sar IPL
 *   @{
 */

#ifdef __cplusplus
extern "C" {
#endif

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Adc_Sar_Ip_Types.h"
#include "Adc_Sar_Ip_Cfg.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define ADC_SAR_IP_VENDOR_ID                   43
#define ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION    4
#define ADC_SAR_IP_AR_RELEASE_MINOR_VERSION    7
#define ADC_SAR_IP_AR_RELEASE_REVISION_VERSION 0
#define ADC_SAR_IP_SW_MAJOR_VERSION            3
#define ADC_SAR_IP_SW_MINOR_VERSION            0
#define ADC_SAR_IP_SW_PATCH_VERSION            0

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same vendor */
#if (ADC_SAR_IP_VENDOR_ID != ADC_SAR_IP_VENDOR_ID_TYPES)
#error "Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h have different vendor ids"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same Autosar version */
#if ((ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION != ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION_TYPES) || \
     (ADC_SAR_IP_AR_RELEASE_MINOR_VERSION != ADC_SAR_IP_AR_RELEASE_MINOR_VERSION_TYPES) || \
     (ADC_SAR_IP_AR_RELEASE_REVISION_VERSION != ADC_SAR_IP_AR_RELEASE_REVISION_VERSION_TYPES))
#error "AutoSar Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Types.h file are of the same Software version */
#if ((ADC_SAR_IP_SW_MAJOR_VERSION != ADC_SAR_IP_SW_MAJOR_VERSION_TYPES) || \
     (ADC_SAR_IP_SW_MINOR_VERSION != ADC_SAR_IP_SW_MINOR_VERSION_TYPES) || \
     (ADC_SAR_IP_SW_PATCH_VERSION != ADC_SAR_IP_SW_PATCH_VERSION_TYPES))
#error "Software Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Types.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same vendor */
#if (ADC_SAR_IP_VENDOR_ID != ADC_SAR_IP_VENDOR_ID_CFG)
#error "Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h have different vendor ids"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same Autosar version */
#if ((ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION != ADC_SAR_IP_AR_RELEASE_MAJOR_VERSION_CFG) || \
     (ADC_SAR_IP_AR_RELEASE_MINOR_VERSION != ADC_SAR_IP_AR_RELEASE_MINOR_VERSION_CFG) || \
     (ADC_SAR_IP_AR_RELEASE_REVISION_VERSION != ADC_SAR_IP_AR_RELEASE_REVISION_VERSION_CFG))
#error "AutoSar Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h are different"
#endif

/* Check if Adc_Sar_Ip.h file and Adc_Sar_Ip_Cfg.h file are of the same Software version */
#if ((ADC_SAR_IP_SW_MAJOR_VERSION != ADC_SAR_IP_SW_MAJOR_VERSION_CFG) || \
     (ADC_SAR_IP_SW_MINOR_VERSION != ADC_SAR_IP_SW_MINOR_VERSION_CFG) || \
     (ADC_SAR_IP_SW_PATCH_VERSION != ADC_SAR_IP_SW_PATCH_VERSION_CFG))
#error "Software Version Numbers of Adc_Sar_Ip.h and Adc_Sar_Ip_Cfg.h are different"
#endif

/*==================================================================================================
*                                     DEFINITIONS
==================================================================================================*/
/*!
 * @brief Macros for status and notification flags
 *
 * These flags map to internal hardware flags in different registers, but are
 * grouped together for convenience.
 *
 */
#define ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN    ((uint32)1U << 0U)
#define ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC         ((uint32)1U << 1U)
#define ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN  ((uint32)1U << 2U)
#define ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC       ((uint32)1U << 3U)
#define ADC_SAR_IP_NOTIF_FLAG_CTU_EOC            ((uint32)1U << 4U)
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN   ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_EOC        ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_EOC      ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC
#define ADC_SAR_IP_STATUS_FLAG_CTU_EOC           ADC_SAR_IP_NOTIF_FLAG_CTU_EOC
#define ADC_SAR_IP_STATUS_FLAG_CALIBRATED        ((uint32)1U << 5U)
#define ADC_SAR_IP_STATUS_FLAG_NORMAL_STARTED    ((uint32)1U << 6U)
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_STARTED  ((uint32)1U << 7U)
#define ADC_SAR_IP_STATUS_FLAG_INJECTED_ABORTED  ((uint32)1U << 8U)
#define ADC_SAR_IP_STATUS_FLAG_CTU_STARTED       ((uint32)1U << 9U)
#define ADC_SAR_IP_STATUS_FLAG_AUTOCLOCKOFF      ((uint32)1U << 10U)

#define ADC_SAR_IP_STATUS_FLAG_ALL                                                                                     \
    (ADC_SAR_IP_STATUS_FLAG_NORMAL_EOC | ADC_SAR_IP_STATUS_FLAG_NORMAL_ENDCHAIN |                                      \
     ADC_SAR_IP_STATUS_FLAG_INJECTED_EOC | ADC_SAR_IP_STATUS_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_STATUS_FLAG_CTU_EOC | \
     ADC_SAR_IP_STATUS_FLAG_CALIBRATED | ADC_SAR_IP_STATUS_FLAG_NORMAL_STARTED |                                       \
     ADC_SAR_IP_STATUS_FLAG_INJECTED_STARTED | ADC_SAR_IP_STATUS_FLAG_INJECTED_ABORTED |                               \
     ADC_SAR_IP_STATUS_FLAG_CTU_STARTED | ADC_SAR_IP_STATUS_FLAG_AUTOCLOCKOFF)
#define ADC_SAR_IP_NOTIF_FLAG_ALL                                                                                      \
    (ADC_SAR_IP_NOTIF_FLAG_NORMAL_EOC | ADC_SAR_IP_NOTIF_FLAG_NORMAL_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_INJECTED_EOC |   \
     ADC_SAR_IP_NOTIF_FLAG_INJECTED_ENDCHAIN | ADC_SAR_IP_NOTIF_FLAG_CTU_EOC)

/*!
 * @brief Macros for channel notifications
 *
 * These notification flags map to internal hardware flags in different registers,
 * but are grouped together for convenience.
 *
 */
#define ADC_SAR_IP_CHAN_NOTIF_EOC ((uint32)1U << 0U)
#define ADC_SAR_IP_CHAN_NOTIF_WDG ((uint32)1U << 1U)

#define ADC_SAR_IP_CHAN_NOTIF_FLAG_ALL (ADC_SAR_IP_CHAN_NOTIF_EOC | ADC_SAR_IP_CHAN_NOTIF_WDG)

/*!
 * @brief Macros for watchdog registers
 *
 * These macros help decode and compose bit mask for watchdog functionality
 *
 */
#define ADC_SAR_IP_WDG_HIGH_FLAG ((uint8)1U << 1U)
#define ADC_SAR_IP_WDG_LOW_FLAG  ((uint8)1U << 0U)

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/
#define ADC_START_SEC_CODE
#include "Adc_MemMap.h"

/*!
 * @brief Return the address of the specified data register
 *
 * This function returns the address of the specified data register
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChannelIndex - adc channel of the Hw unit
 * @return status:
 *  - value of the address of the data for the specified channel
 */
uint32 Adc_Sar_Ip_GetDataAddress(uint32 u32Instance, uint32 u32ChannelIndex);

/*!
 * @brief Initialize ADC_SAR module
 *
 * This function initializes the ADC_SAR module by configuring all
 * available features.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pConfig - configuration struct pointer
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: init successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: init step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Init(uint32 const u32Instance, Adc_Sar_Ip_ConfigType const* const pConfig);

/*!
 * @brief Deinitialize ADC_SAR module
 *
 * This function resets the ADC internal registers to default values.
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: deinit successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: deinit step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Deinit(uint32 const u32Instance);

/*!
 * @brief Configures the converter chains the given configuration structure
 *
 * This function configures the ADC Normal and Injected Chains with the options
 * provided in the structure.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChansIdxMask - channel configuration structure
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @return void
 */
void Adc_Sar_Ip_ChainConfig(uint32 const u32Instance, Adc_Sar_Ip_ChansIdxMaskType const* const pChansIdxMask,
                            Adc_Sar_Ip_ConvChainType const pChainType);

/*!
 * @brief Enable a channel
 *
 * This function enables a channel in a specified conversion chain
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_EnableChannel(uint32 const u32Instance, Adc_Sar_Ip_ConvChainType const pChainType,
                              uint32 const u32ChnIdx);

/*!
 * @brief Disable a channel
 *
 * This function disables a channel in a specified conversion chain
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_DisableChannel(uint32 const u32Instance, Adc_Sar_Ip_ConvChainType const pChainType,
                               uint32 const u32ChnIdx);

#if (ADC_SAR_IP_SET_RESOLUTION == STD_ON)
/*!
 * @brief Set conversion resolution
 *
 * This function sets the conversion resolution (number of bits per conversion data)
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] eResolution - conversion resolution
 * @return void
 */
void Adc_Sar_Ip_SetResolution(uint32 const u32Instance, Adc_Sar_Ip_Resolution const eResolution);
#endif /* (ADC_SAR_IP_SET_RESOLUTION == STD_ON) */

/*!
 * @brief Start conversion
 *
 * This function starts a conversion channel (Normal or Injected)
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal or Injected)
 * @return void
 */
void Adc_Sar_Ip_StartConversion(uint32 const u32Instance, Adc_Sar_Ip_ConvChainType const pChainType);

/*!
 * @brief Get the status flags
 *
 * This function returns the status flags of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @return the status flag bit-mask
 */
uint32 Adc_Sar_Ip_GetStatusFlags(uint32 const u32Instance);

/*!
 * @brief Clear the status flags
 *
 * This function clears the status flags of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32Mask - bit-mask of flags to clear
 * @return void
 */
void Adc_Sar_Ip_ClearStatusFlags(uint32 const u32Instance, uint32 const u32Mask);

/*!
 * @brief Self test
 *
 * This function executes a self test on the ADC instance.
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: self testing successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: self testing step timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SelfTest(uint32 const u32Instance);

/*!
 * @brief Get conversion results for a conversion chain
 *
 * This function gets the conversion results for the selected Conversion Chain.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param[in] u32Length - the length of the buffer
 * @param[out] pResults - the output buffer
 * @return the number of values written in the buffer (max length)
 */
uint32 Adc_Sar_Ip_GetConvDataToArray(uint32 const u32Instance, Adc_Sar_Ip_ConvChainType const pChainType,
                                     uint32 const u32Length, uint16* const pResults);

/*!
 * @brief Get conversion results for a conversion chain with extended information
 *
 * This function gets the conversion results for the selected Conversion Chain, with
 * extended information about each conversion result (channel index, valid an overwritten
 * properties and conversion data). This function should be used in case of configurations
 * with overlapping channel lists in different chains, resulting in overwrite of conversion
 * data when a higher priority chain is executed before all data was read.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param[in] u32Length - the length of the buffer
 * @param[out] pResults - the output buffer
 * @return the number of values written in the buffer (max length)
 */
uint32 Adc_Sar_Ip_GetConvResultsToArray(uint32 const u32Instance, Adc_Sar_Ip_ConvChainType const pChainType,
                                        uint32 const u32Length, Adc_Sar_Ip_ChanResultType* const pResults);

/*!
 * @brief Return the result of the conversion
 *
 * This function returns the result of the conversion for a single channel
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u32ChnIdx - channel 0
 * @return conversion data
 */
uint16 Adc_Sar_Ip_GetConvData(uint32 const u32Instance, uint32 const u32ChnIdx);

/*!
 * @brief Return the result and the status of the conversion
 *
 * This function returns the result and the status of the conversion
 * for a single channel
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u32ChnIdx - channel 0
 * @param [in] pChainType - conversion chain (Normal, Injected or CTU)
 * @param [out] pResult - pointer to the buffer where the result will be written
 * @return void
 */
void Adc_Sar_Ip_GetConvResult(uint32 const u32Instance, uint32 const u32ChnIdx,
                              Adc_Sar_Ip_ConvChainType const pChainType, Adc_Sar_Ip_ChanResultType* const pResult);

/*!
 * @brief Perform Calibration of the ADC
 *
 * This function performs a calibration of the ADC. The maximum input clock
 * frequency for the ADC is 80 MHz, checked with assertions if DEV_ASSERT is
 * enabled. After calibration, the ADC is left in Powerup state (PWDN bit is clear).
 *
 * @param[in] u32Instance - ADC instance number
 * @return the calibration result
 *  - ADC_SAR_IP_STATUS_SUCCESS: calibration successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: calibration step timed out
 *  - ADC_SAR_IP_STATUS_ERROR: calibration failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_DoCalibration(uint32 const u32Instance);

/*!
 * @brief Power up the ADC
 *
 * This function enables the ADC (disables the Power Down feature).
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: power up successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerup(uint32 const u32Instance);

/*!
 * @brief Power down the ADC
 *
 * This function disables the ADC (enables the Power Down feature).
 *
 * @param[in] u32Instance - ADC instance number
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: power down successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power down failed
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_Powerdown(uint32 const u32Instance);

