DDC-NDRS/zephyr_hal_nxp/s32/drivers/s32k3/Adc/include/Adc_Sar_Ip.h
#if ((STD_ON == ADC_SAR_IP_ECH_ENABLED) || (STD_ON == ADC_SAR_IP_JECH_ENABLED) ||                                      \
     (STD_ON == ADC_SAR_IP_EOC_ENABLED) || ((FEATURE_ADC_HAS_CTU == 1U) && (STD_ON == ADC_SAR_IP_EOCTU_ENABLED)))
/*!
 * @brief Enable ADC interrupts
 *
 * This function enables ADC interrupts.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32NotificationMask - mask of interrupts to enable (of status flags)
 * @return void
 */
void Adc_Sar_Ip_EnableNotifications(uint32 const u32Instance, uint32 const u32NotificationMask);

/*!
 * @brief Disable ADC interrupts
 *
 * This function disables ADC interrupts.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32NotificationMask - mask of interrupts to disable (of status flags)
 * @return void
 */
void Adc_Sar_Ip_DisableNotifications(uint32 const u32Instance, uint32 const u32NotificationMask);
#endif /* (STD_ON == ADC_SAR_IP_ECH_ENABLED) .. */

#if ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED))
/*!
 * @brief Enable ADC interrupt for a channel
 *
 * This function enables interrupt generation on End of Conversion and watchdog
 * events for a single channel.
 * The mask parameter can be set using the defines provided in the driver header
 * file that have the pattern ADC_SAR_IP_CHAN_NOTIF_... e.g. ADC_SAR_IP_CHAN_NOTIF_EOC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @param[in] u32Mask - mask selecting targeted events
 * @return void
 */
void Adc_Sar_Ip_EnableChannelNotifications(uint32 const u32Instance, uint32 const u32ChnIdx, uint32 const u32Mask);

/*!
 * @brief Disable ADC interrupt for a channel
 *
 * This function disables interrupt generation on End of Conversion and watchdog
 * events for a single channel.
 * The mask parameter can be set using the defines provided in the driver header
 * file that have the pattern ADC_SAR_IP_CHAN_NOTIF_... e.g. ADC_SAR_IP_CHAN_NOTIF_EOC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @param[in] u32Mask - mask selecting targeted events
 * @return void
 */
void Adc_Sar_Ip_DisableChannelNotifications(uint32 const u32Instance, uint32 const u32ChnIdx, uint32 const u32Mask);
#endif /* ((STD_ON == ADC_SAR_IP_WDG_ENABLED) || (STD_ON == ADC_SAR_IP_EOC_ENABLED)) */

/*!
 * @brief Set the ADC clocks
 *
 * This function initializes the ADC clock configuration.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pConfig - the clock configuration
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: set successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up or down sequence timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SetClockMode(uint32 const                            u32Instance,
                                              Adc_Sar_Ip_ClockConfigType const* const pConfig);

#if FEATURE_ADC_HAS_CONVERSION_TIMING
/*!
 * @brief Set the sample times
 *
 * This function sets the sample times for each channnel group.
 * Note: aSampleTimes must contain the sample times in order of the channel
 * groups, e.g. sample time for the channel group 1 must be on the first position.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] aSampleTimes - array with size ADC_SAR_IP_NUM_GROUP_CHAN containing sample times for each channel group
 * @return void
 */
void Adc_Sar_Ip_SetSampleTimes(uint32 const u32Instance, uint8 const* const aSampleTimes);
#endif /* FEATURE_ADC_HAS_CONVERSION_TIMING */

#if FEATURE_ADC_HAS_AVERAGING
/*!
 * @brief Configure averaging
 *
 * This function enables averaging and selects the number of conversions to average.
 * The mask parameter should be set using the Adc_Sar_Ip_AvgSelectType enum elements
 * that have the pattern ADC_SAR_IP_AVG_... e.g. ADC_SAR_IP_AVG_4_CONV.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] bAvgEn - enable or disable averaging
 * @param[in] eAvgSel - selects number of conversions to average
 * @return void
 */
void Adc_Sar_Ip_SetAveraging(uint32 const u32Instance, boolean const bAvgEn, Adc_Sar_Ip_AvgSelectType const eAvgSel);
#endif /* FEATURE_ADC_HAS_AVERAGING */

/*!
 * @brief Abort ongoing conversion
 *
 * This function aborts an ongoing conversion.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_AbortConversion(uint32 const u32Instance);

/*!
 * @brief Abort ongoing chain conversion
 *
 * This function aborts an ongoing chain of conversions.
 * If scan(continuos) mode is selected, then bAllowRestart selects whether
 * the abort command restarts the chain or stops it. For one shot conversion,
 * this should be FALSE.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] bBlocking - wait and check that the ongoing conversion has stopped
 * @param[in] bAllowRestart - restart continuos conversion instead of aborting
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: abort successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: ongoing conversion could not be stopped
 * @return void
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_AbortChain(uint32 const u32Instance, boolean const bBlocking,
                                            boolean const bAllowRestart);

#if FEATURE_ADC_HAS_PRESAMPLING
/*!
 * @brief Set the Presampling Source for the channel group
 *
 * This function configures the Presampling Source for a channel group.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pChanGroup - the channel group
 * @param[in] pPresampleSource - the presampling source
 * @return void
 */
void Adc_Sar_Ip_SetPresamplingSource(uint32 const u32Instance, Adc_Sar_Ip_ChanGroupType const pChanGroup,
                                     Adc_Sar_Ip_PresamplingSourceType const pPresampleSource);

/*!
 * @brief Enable Presampling on one channel
 *
 * This function enables the Presampling on one channel of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_EnableChannelPresampling(uint32 const u32Instance, uint32 const u32ChnIdx);

/*!
 * @brief Disable Presampling on one channel
 *
 * This function disables the Presampling on one channel of the ADC.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_DisableChannelPresampling(uint32 const u32Instance, uint32 const u32ChnIdx);

/*!
 * @brief Enable Conversion Presampled Data
 *
 * This function enables bypass of the Sampling Phase, resulting in a conversion
 * of the presampled data. This is available only for channels that have presampling
 * enabled.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_EnablePresampleConversion(uint32 const u32Instance);

/*!
 * @brief Disable Conversion of Presampled Data
 *
 * This function disables Sampling Phase bypass.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisablePresampleConversion(uint32 const u32Instance);
#endif /* FEATURE_ADC_HAS_PRESAMPLING */

/*!
 * @brief Enable DMA Requests
 *
 * This function enables requests to DMA from ADC
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_EnableDma(uint32 const u32Instance);

/*!
 * @brief Disable DMA Requests
 *
 * This function disables requests to DMA from ADC
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisableDma(uint32 const u32Instance);

/*!
 * @brief Enable DMA on one channel
 *
 * This function enables DMA requests triggered by End of Conversion event from
 * a selected channel.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_EnableChannelDma(uint32 const u32Instance, uint32 const u32ChnIdx);

/*!
 * @brief Disable DMA on one channel
 *
 * This function disables DMA requests triggered by End of Conversion event from
 * a selected channel.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] u32ChnIdx - channel 0
 * @return void
 */
void Adc_Sar_Ip_DisableChannelDma(uint32 const u32Instance, uint32 const u32ChnIdx);

/*!
 * @brief Disable DMA on all channels
 *
 * This function disables DMA requests triggered by End of Conversion event from
 * all channels.
 *
 * @param[in] u32Instance - ADC instance number
 * @return void
 */
void Adc_Sar_Ip_DisableChannelDmaAll(uint32 const u32Instance);

/*!
 * @brief Set DMA Request Clear Source
 *
 * This function selects the DMA Request Flag Clear Source.
 *
 * @param[in] u32Instance - ADC instance number
 * @param[in] pDmaClear - the clear source for DMA Requests (Ack from DMA Controller or
    read of data registers)
 * @return void
 */
void Adc_Sar_Ip_SetDmaClearSource(uint32 const u32Instance, Adc_Sar_Ip_ClearSourceType const pDmaClear);

#if (STD_ON == ADC_SAR_IP_WDG_ENABLED)
/*!
 * @brief Configure watchdog threshold register
 *
 * This function configures the high/low thresholds for a certain register.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] u8RegisterIdx - the index of the register
 * @param [in] pThresholdValues - the threshold values
 * @return void
 */
void Adc_Sar_Ip_SetWdgThreshold(uint32 const u32Instance, uint8 const u8RegisterIdx,
                                Adc_Sar_Ip_WdgThresholdType const* const pThresholdValues);
#endif /* (STD_ON == ADC_SAR_IP_WDG_ENABLED) */

/*!
 * @brief Configure conversion mode
 *
 * This function configures the used conversion mode.
 * Note: The selected ADC instance must be in the IDLE state.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eConvMode - selected conversion mode
 * @return void
 */
void Adc_Sar_Ip_SetConversionMode(uint32 const u32Instance, Adc_Sar_Ip_ConvModeType const eConvMode);

#if FEATURE_ADC_HAS_CTU
/*!
 * @brief Configure CTU mode
 *
 * This function configures the CTU mode and enable.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eCtuMode - selected CTU mode
 * @return status:
 *  - ADC_SAR_IP_STATUS_SUCCESS: set successful
 *  - ADC_SAR_IP_STATUS_TIMEOUT: power up or down sequence timed out
 */
Adc_Sar_Ip_StatusType Adc_Sar_Ip_SetCtuMode(uint32 const u32Instance, Adc_Sar_Ip_CtuModeType const eCtuMode);
#endif /* FEATURE_ADC_HAS_CTU */

#if (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE)
#if (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER)
/*!
 * @brief Configure external trigger
 *
 * This function configures the external trigger.
 *
 * @param [in] u32Instance - ADC instance number
 * @param [in] eTriggerEdge - selected external trigger type
 * @param [in] eTrggerSrc - selects normal, auxiliary normal or injected trigger
 * @return void
 */
void Adc_Sar_Ip_SetExternalTrigger(uint32 const u32Instance, Adc_Sar_Ip_ExtTriggerEdgeType const eTriggerEdge,
                                   Adc_Sar_Ip_ExtTriggerSourceType const eTrggerSrc);
#endif /* (FEATURE_ADC_HAS_INJ_EXT_TRIGGER || FEATURE_ADC_HAS_EXT_TRIGGER) */
#endif /* (ADC_SAR_IP_EXTERNAL_TRIGGER_ENABLE) */

